# CurtaingridAngleV Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
ParameterTypeId..::..CurtaingridAngleV Property
ParameterTypeId Class See Also
---
"Grid Rotation"
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static ForgeTypeId CurtaingridAngleV { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property CurtaingridAngleV As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ CurtaingridAngleV {
	ForgeTypeId^ get ();
}
```

# See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace